import csv
 
#CCTV
f = open('개인정보보호위원회_공공기관 보유 CCTV현황_20230823.csv','r')
b = open('공공기관 보유 CCTV 현황.csv','w')
rdr = csv.reader(f)

a = [['지역','설치 수'],['인천', 0 ],['강원', 0 ],['서울', 0 ],['충청남도', 0 ],['충청북도', 0 ],['경상북도', 0 ],['경상남도', 0 ],
    ['전라남도', 0 ], ['전라북도', 0 ], ['제주', 0 ], ['대구', 0 ], ['울산', 0 ],['세종', 0 ] ]


for line in rdr:
    for i in a[1:]:
        if i[0] in line[3]:
            i[1] += int(line[4])


print(a)


wr = csv.writer(b)
wr.writerows(a)

f.close()
b.close()

#######################################
#인구수
f = open('행정안전부_지역별(행정동) 성별 연령별 주민등록 인구수_20231130.csv','r')
b = open('행정안전부_지역별(행정동) 성별 연령별 주민등록 인구수.csv','w')
rdr = csv.reader(f)

#경기도
a = [['지역','설치 수'],['인천', 0 ],['강원', 0 ],['서울', 0 ],['충청남도', 0 ],['충청북도', 0 ],['경상북도', 0 ],['경상남도', 0 ],
    ['전라남도', 0 ], ['전라북도', 0 ], ['제주', 0 ], ['대구', 0 ], ['울산', 0 ], ['세종', 0 ] ]


for line in rdr:
    for i in a[1:]:
        if i[0] in line[2]:
            i[1] += int(line[5])


print(a)


wr = csv.writer(b)
wr.writerows(a)

f.close()
b.close()

################################
#범죄
"""f = open('대검찰청_범죄발생 지역_20211231.csv','r')
b = open('대검찰청_범죄발생 지역.csv','w')
rdr = csv.reader(f)

#경기도
a = [['지역','설치 수'],['인천', 0 ],['강원', 0 ],['서울', 0 ],['충청남도', 0 ],['충청북도', 0 ],['경상북도', 0 ],['경상남도', 0 ],
    ['전라남도', 0 ], ['전라북도', 0 ], ['제주', 0 ], ['대구', 0 ], ['울산', 0 ],['세종', 0 ] ]


for line in rdr:
    for i in a[1:]:
        if i[0] in line[3]:
            i[1] += int(line[4])


print(a)


wr = csv.writer(b)
wr.writerows(a)

f.close()
b.close()"""